SolutionApps/App.Solutions/App.WebAPIConfigService/App_Data/ApiLogFiles/UserLogFiles/RYR95RXRB5/EnhancedBookMultiSegmentRQ.log

<?xml version='1.0' encoding='UTF-8'?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sec="http://schemas.xmlsoap.org/ws/2002/12/secext" xmlns:eb="http://www.ebxml.org/namespaces/messageHeader"><soapenv:Header>  <eb:MessageHeader soapenv:mustUnderstand="1" eb:version="1.0">       <eb:From>           <eb:PartyId eb:type="urn: x12.org:IO5: 01">999999</eb:PartyId>       </eb:From>       <eb:To>           <eb:PartyId type="urn:x12.org:IO5:01">123123</eb:PartyId>       </eb:To>       <eb:CPAId>3RT2</eb:CPAId>       <eb:ConversationId>1111111111111111111</eb:ConversationId>       <eb:Service eb:type="sabreXML">EnhancedAirBookRQ</eb:Service>       <eb:Action>EnhancedAirBookRQ</eb:Action>       <eb:MessageData>           <eb:MessageId>mid:0_2014-09-22T21:43:40m</eb:MessageId>           <eb:Timestamp>2014-09-22T21:43:40</eb:Timestamp>           <eb:TimeToLive>2014-09-22T21:43:40</eb:TimeToLive>       </eb:MessageData>       <eb:DuplicateElimination/>       <eb:Description>Air Book Service</eb:Description>   </eb:MessageHeader>   <sec:Security xmlns:wsse="http://schemas.xmlsoap.org/ws/2002/12/secext" xmlns:wsu="http://schemas.xmlsoap.org/ws/2002/12/utility">       <sec:BinarySecurityToken>Shared/IDL:IceSess\/SessMgr:1\.0.IDL/Common/!ICESMS\/RESA!ICESMSLB\/RES.LB!1540820967172!27571541!196609</sec:BinarySecurityToken>   </sec:Security></soapenv:Header><soapenv:Body>    <EnhancedAirBookRQ  xmlns="http://services.sabre.com/sp/eab/v3_6"  version="3.6.0" IgnoreOnError="true" HaltOnError="false" >     <OTA_AirBookRQ>   <RetryRebook Option="true"/>   <HaltOnStatus Code="NO"/>   <HaltOnStatus Code="NN"/>   <HaltOnStatus Code="UC"/>   <HaltOnStatus Code="US"/>   <HaltOnStatus Code="WL"/>   <HaltOnStatus Code="HL"/>   <HaltOnStatus Code="UN"/>   <HaltOnStatus Code="PN"/>   <HaltOnStatus Code="LL"/>      <OriginDestinationInformation>   <FlightSegment DepartureDateTime="2019-03-14T23:00" ArrivalDateTime="2019-03-15T09:50" FlightNumber="6150" NumberInParty="1" ResBookDesigCode="O" Status="NN">      <DestinationLocation   LocationCode="LGW"/>      <Equipment AirEquipType="777"/>      <MarketingAirline Code="AA" FlightNumber="6150"/>      <OperatingAirline Code="BA"/>      <OriginLocation   LocationCode="JFK"/>     </FlightSegment>   <FlightSegment DepartureDateTime="2019-04-01T20:25" ArrivalDateTime="2019-04-01T23:45" FlightNumber="3717" NumberInParty="1" ResBookDesigCode="S" Status="NN">      <DestinationLocation   LocationCode="MAD"/>      <Equipment AirEquipType="32A"/>      <MarketingAirline Code="IB" FlightNumber="3717"/>      <OperatingAirline Code="I2"/>      <OriginLocation   LocationCode="LGW"/>     </FlightSegment>   <FlightSegment DepartureDateTime="2019-04-02T11:10" ArrivalDateTime="2019-04-02T13:15" FlightNumber="4001" NumberInParty="1" ResBookDesigCode="O" Status="NN">      <DestinationLocation   LocationCode="JFK"/>      <Equipment AirEquipType="772"/>      <MarketingAirline Code="IB" FlightNumber="4001"/>      <OperatingAirline Code="AA"/>      <OriginLocation   LocationCode="MAD"/>     </FlightSegment>   <FlightSegment DepartureDateTime="2019-04-02T21:45" ArrivalDateTime="2019-04-02T23:27" FlightNumber="4273" NumberInParty="1" ResBookDesigCode="O" Status="NN">      <DestinationLocation   LocationCode="DCA"/>      <Equipment AirEquipType="E75"/>      <MarketingAirline Code="IB" FlightNumber="4273"/>      <OperatingAirline Code="AA"/>      <OriginLocation   LocationCode="JFK"/>     </FlightSegment>      </OriginDestinationInformation>     <RedisplayReservation NumAttempts="2" WaitInterval="5000"/>     </OTA_AirBookRQ> <PostProcessing IgnoreAfter ="false">   <RedisplayReservation WaitInterval ="5000"/> </PostProcessing>    </EnhancedAirBookRQ>   </soapenv:Body></soapenv:Envelope>